"""
bill.txt
将文件写出到bill.txt.bak文件作为备份
同时，将文件内标记为测试的数据行丢弃

name,date,money,type,remarks
周杰轮,2022-01-01,100000,消费,正式
周杰轮,2022-01-02,300000,收入,正式
周杰轮,2022-01-03,100000,消费,测试
林俊节,2022-01-01,300000,收入,正式
林俊节,2022-01-02,100000,消费,测试
林俊节,2022-01-03,100000,消费,正式
林俊节,2022-01-04,100000,消费,测试
林俊节,2022-01-05,500000,收入,正式
张学油,2022-01-01,100000,消费,正式
张学油,2022-01-02,500000,收入,正式
张学油,2022-01-03,900000,收入,测试
王力鸿,2022-01-01,500000,消费,正式
王力鸿,2022-01-02,300000,消费,测试
王力鸿,2022-01-03,950000,收入,正式
刘德滑,2022-01-01,300000,消费,测试
刘德滑,2022-01-02,100000,消费,正式
刘德滑,2022-01-03,300000,消费,正式
"""

bill_file = open("bill.txt", "r", encoding="UTF-8")
back_file = open("bill.txt.bak", "a", encoding="UTF-8")

# 遍历文件的每一行
for line in bill_file:
    # 将行转为列表
    line = line.strip().split(",")
    # 判断最后一个元素是否是测试
    if line[-1] != "测试":
        words = ""
        # 遍历列表, 将每个元素存入到words中
        # 如果是列表的最好一个元素则加换行符, 否则追加,
        for i in range(len(line)):
            if i != (len(line) - 1):
                words += line[i] + ","
            else:
                words += line[i] + "\n"
        back_file.write(str(words))

back_file.close()
bill_file.close()
